Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The default set of value resolvers can be registered via the convenient `EngineBuilder.addDefaultSectionHelpers()` method and the `EngineBuilder.addDefaults()` method respectively.
ja_jp: デフォルトの値リゾルバーのセットは、便利な `EngineBuilder.addDefaultSectionHelpers()` メソッドと `EngineBuilder.addDefaults()` メソッドを介して、それぞれ登録することができます。

source: The default set of value resolvers can be registered via the convenient `EngineBuilder.addDefaultValueResolvers()` method and the `EngineBuilder.addDefaults()` method respectively.
ja_jp: デフォルトの値リゾルバーのセットは、便利な `EngineBuilder.addDefaultValueResolvers()` メソッドと `EngineBuilder.addDefaults()` メソッドを介して、それぞれ登録することができます。

source: The default startup timeout for Dev Services is 60s, if this is not enough you can increase it with the `quarkus.devservices.timeout` property.
ja_jp: Dev Servicesのデフォルトの起動タイムアウトは60秒です。もしこれが十分でない場合は、 `quarkus.devservices.timeout` プロパティで増やすことができます。

source: The default state cookie age is 5 mins and you can change it with a `quarkus.oidc.authentication.state-cookie-age` Duration property.
ja_jp: デフォルトの状態 Cookie の有効期間は 5 分ですが、これは `quarkus.oidc.authentication.state-cookie-age` Duration プロパティーを使用して変更できます。

source: The default state cookie age is 5 minutes, and you can change it with a `quarkus.oidc.authentication.state-cookie-age` Duration property.
ja_jp: デフォルトの状態 Cookie の有効期間は 5 分ですが、これは `quarkus.oidc.authentication.state-cookie-age` Duration プロパティーを使用して変更できます。

source: The default style for Swagger UI has changed from the vanilla Swagger UI to a Quarkus branded page:
ja_jp: Swagger UIのデフォルトスタイルがバニラのSwagger UIからQuarkusブランドのページに変更されました。

source: The default support for AWS security only maps the principal name to Quarkus security APIs and do nothing to map claims, or roles, or permissions. You have full control on how security metadata in the lambda HTTP event is mapped to Quarkus Security APIs using implementations of the `io.quarkus.amazon.lambda.http.LambdaIdentityProvider` interface. By implementing this interface, you can do things like define role mappings for your principal or publish additional attributes provided by IAM, or Cognito, or your Custom Lambda security integration.
ja_jp: AWS セキュリティーのデフォルトのサポートは、プリンシパル名を Quarkus セキュリティー API にマップするだけで、クレーム、ロール、またはパーミッションをマップすることはありません。 `io.quarkus.amazon.lambda.http.LambdaIdentityProvider` インターフェイスの実装を使用して、Lambda HTTP イベントのセキュリティーメタデータを Quarkus セキュリティー API にマッピングする方法を完全に制御できます。このインターフェイスを実装することにより、プリンシパルのロールマッピングを定義したり、IAM または Cognito、もしくはカスタム Lambda セキュリティー統合によって提供される追加の属性を公開したりすることができます。

source: The default support for AWS security only maps the principal name to Quarkus security APIs and does nothing to map claims or roles or permissions. You have can full control how security metadata in the lambda HTTP event is mapped to Quarkus security APIs using implementations of the `io.quarkus.amazon.lambda.http.LambdaIdentityProvider` interface. By implementing this interface, you can do things like define role mappings for your principal or publish additional attributes provided by IAM or Cognito or your Custom Lambda security integration.
ja_jp: AWS セキュリティーのデフォルトのサポートは、プリンシパル名を Quarkus セキュリティー API にマップするだけで、クレーム、ロール、またはパーミッションをマップすることはありません。 `io.quarkus.amazon.lambda.http.LambdaIdentityProvider` インターフェイスの実装を使用して、Lambda HTTP イベントのセキュリティーメタデータを Quarkus セキュリティー API にマッピングする方法を完全に制御できます。このインターフェイスを実装することにより、プリンシパルのロールマッピングを定義したり、IAM または Cognito、もしくはカスタム Lambda セキュリティー統合によって提供される追加の属性を公開したりすることができます。

source: The default support for AWS security only maps the principal name to Quarkus security APIs and does nothing to map claims or roles or permissions. You have full control on how security metadata in the lambda HTTP event is mapped to Quarkus Security APIs using implementations of the `io.quarkus.amazon.lambda.http.LambdaIdentityProvider` interface. By implementing this interface, you can do things like define role mappings for your principal or publish additional attributes provided by IAM or Cognito or your Custom Lambda security integration.
ja_jp: AWSセキュリティのデフォルトサポートは、プリンシパル名をQuarkusセキュリティAPIにマッピングするだけで、クレームやロール、パーミッションのマッピングは何も行いません。 `io.quarkus.amazon.lambda.http.LambdaIdentityProvider` インターフェースの実装を使用して、ラムダHTTPイベントのセキュリティメタデータがQuarkus Security APIにマッピングされる方法を完全に制御することができます。このインターフェースを実装することで、プリンシパルのロールマッピングを定義したり、IAMやCognito、カスタムLambdaセキュリティ統合によって提供される追加属性を公開したりすることができます。

source: The default support for AWS security only maps the principal name to Quarkus security APIs and does nothing to map claims or roles or permissions. You have full control on how security metadata in the lambda HTTP event is mapped to Quarkus security APIs using implementations of the `io.quarkus.amazon.lambda.http.LambdaIdentityProvider` interface. By implementing this interface, you can do things like define role mappings for your principal or publish additional attributes provided by IAM or Cognito or your Custom Lambda security integration.
ja_jp: AWS セキュリティーのデフォルトのサポートは、プリンシパル名を Quarkus セキュリティー API にマップするだけで、クレーム、ロール、またはパーミッションをマップすることはありません。 `io.quarkus.amazon.lambda.http.LambdaIdentityProvider` インターフェイスの実装を使用して、Lambda HTTP イベントのセキュリティーメタデータを Quarkus セキュリティー API にマッピングする方法を完全に制御できます。このインターフェイスを実装することにより、プリンシパルのロールマッピングを定義したり、IAM または Cognito、もしくはカスタム Lambda セキュリティー統合によって提供される追加の属性を公開したりすることができます。

source: The default tenant configuration is automatically disabled when `quarkus.oidc.auth-server-url` is not configured, but either custom tenant configurations are available or `TenantConfigResolver` is registered.
ja_jp: `quarkus.oidc.auth-server-url` が設定されていない場合、デフォルトのテナント設定は自動的に無効になりますが、カスタムテナント設定が使用可能であるか、`TenantConfigResolver` が登録されています。

source: The default tenant configuration should be adjusted like this:
ja_jp: デフォルトのテナント設定は、次のように調整する必要があります。

source: The default tenant's `OidcConfigurationMetadata` is injected if the endpoint is public.
ja_jp: エンドポイントがパブリックの場合、デフォルトのテナントの `OidcConfigurationMetadata` が注入されます。

source: The default timeout is configured to 10s.
ja_jp: デフォルトのタイムアウトは 10 秒に設定されています。

source: The default value is 60 seconds.
ja_jp: デフォルト値は60秒です。

source: The default value is actually an <<expressions,expression>>. So the default value does not have to be a literal (such as `42` or `true`). For example, you can leverage the `@TemplateEnum` and specify an enum constant as a default value of a parameter declaration: `{@org.acme.MyEnum myEnum=MyEnum:FOO}`. However, the infix notation is not supported in default values unless the parentheses are used for grouping, e.g. `{@org.acme.Foo foo=(foo1 ?: foo2)}`.
ja_jp: 実際のデフォルト値は <<expressions,expression>> です。そのため、デフォルト値はリテラル (`42` や `true` など) である必要はありません。たとえば、`@TemplateEnum` を使用して、パラメーター宣言のデフォルト値として enum 定数を指定できます (`{@org.acme.MyEnum myEnum=MyEnum:FOO}`)。 しかし、括弧を使用してグループ化されていない限り (例: `{@org.acme.Foo foo=(foo1 ?: foo2)}`)、デフォルト値で中置記法はサポートされません。

source: The default value is actually an <<expressions,expression>>. So the default value does not have to be a literal (such as `42` or `true`). For example, you can leverage the `@TemplateEnum` and specify an enum constant as a default value of a parameter declaration: `{@org.acme.MyEnum myEnum=MyEnum:FOO}`. However, the infix notation is not supported in default values.
ja_jp: デフォルト値は、実際には <<expressions,式>> です。そのため、デフォルト値はリテラルである必要はありません (`42` や `true` など)。たとえば、 `@TemplateEnum` を利用して、パラメーター宣言のデフォルト値として enum 定数を指定することができます (`{@org.acme.MyEnum myEnum=MyEnum:FOO}`)。しかし、デフォルト値では中置記法はサポートされていません。

source: The default value is injected if the configuration does not provide a value for `greeting.suffix`.
ja_jp: デフォルト値は、設定が `greeting.suffix` の値を提供していない場合に注入されます。

source: The default value of `quarkus.rest-client.logging.masked-headers` (`Authorization` and `Cookie`) will be replaced when you explicitly configure a value. You *must* explicitly include them if you still need them masked.
ja_jp: `quarkus.rest-client.logging.masked-headers` のデフォルト値 (`Authorization` と `Cookie`) は、値を明示的に設定すると置き換えられます。 マスクを維持する必要がある場合は、それらを *明示的に* 含める必要があります。

source: The default, HTTP works as normal
ja_jp: デフォルトでは、 HTTP は通常通りに動作します。

source: The defaults for the different parts are as follows:
ja_jp: 各パートのデフォルトは以下の通り：

source: The delay will be a value between 0 and 500 milliseconds. As a result, the period between to `everyTwoSeconds()` executions will be roughly between one and a half and two and a half seconds.
ja_jp: 遅延の値は 0 - 500 ミリ秒です。その結果、 `everyTwoSeconds()` 実行間隔は、およそ 1.5 - 2.5 秒です。

source: The demo has 5 parts. Please read the summary and then jump to the section that best fits your use case.
ja_jp: デモには 5 つの部分があります。概要を読んでから、ユースケースに最も適したセクションに進んでください。

source: The demo used https://github.com/michalszynkiewicz/rest-client-reactive-stork[this project] as the client-side, each of the steps has a corresponding commit in the `main` branch. The backend services were instances of https://github.com/michalszynkiewicz/configurable-rest-service[this project], and the custom service discovery server implementation can be found https://github.com/michalszynkiewicz/simple-service-discovery-server[here].
ja_jp: このデモでは、クライアント側に link:https://github.com/michalszynkiewicz/rest-client-reactive-stork[このプロジェクト]を使用しており、各ステップには `main` ブランチに対応するコミットがあります。バックエンドサービスは link:https://github.com/michalszynkiewicz/configurable-rest-service[このプロジェクト] のインスタンスであり、カスタムサービスディスカバリーサーバーの実装は link:https://github.com/michalszynkiewicz/simple-service-discovery-server[こちら]にあります。

source: The dependencies
ja_jp: 依存関係

source: The dependencies remain the same as in <<vertx-oidc-to-quarkus-oidc>> section, but we add one more JAX-RS resource that manages a login callback:
ja_jp: 依存関係は <<vertx-oidc-to-quarkus-oidc>> セクションと同じですが、ログインコールバックを管理する JAX-RS リソースをさらにもう 1 つ追加します。

source: The dependency on `quarkus-arc-deployment` generated by the `create-extension` mojo can now be removed since `quarkus-undertow-deployment` already depends on it.
ja_jp: `create-extension` mojo で生成された `quarkus-core-deployment` への依存は、 `quarkus-undertow-deployment` が既に依存しているので、これで削除できます。

source: The dependency on `quarkus-arc` generated by the `create-extension` mojo can now be removed since `quarkus-undertow` already depends on it.
ja_jp: `create-extension` mojo で生成された `quarkus-core-deployment` への依存関係は、 `quarkus-undertow-deployment` が既に依存しているため削除できます。

source: The dependency version is managed by Quarkus, so you don't need to specify it explicitly.
ja_jp: 依存関係のバージョンは Quarkus によって管理されるため、明示的に指定する必要はありません。

source: The deployment module
ja_jp: deployment モジュール

source: The deployment module *must* depend on the `runtime` module.
ja_jp: デプロイメントモジュールは実行時モジュールに依存してい *なければなりません* 。

source: The deployment module - this is the one of interest for our blog post
ja_jp: デプロイメントモジュール - 今回のブログ記事ではこのモジュールを紹介します。

source: The deployment module also *must* depend on the runtime module.
ja_jp: デプロイメントモジュールも実行時モジュールに依存している *必要があります* 。

source: The deployment module depends on the `quarkus-arc-deployment` artifact. We will see later which dependencies are convenient to add.
ja_jp: デプロイメントモジュールは `quarkus-core-deployment` アーティファクトに依存しています。どの依存関係を追加するのが便利かは後ほど見ていきます。

source: The deployment module does not require any specific plugin. Here is an example of a minimal `build.gradle` file for the `deployment` module:
ja_jp: deployment モジュールは、特定のプラグインを必要としません。以下は、 `deployment` モジュールの最小の `build.gradle` ファイルの例です。

source: The deployment procedure differs based on the Java version your {project-name} application uses.
ja_jp: デプロイ手順は、{project-name} アプリケーションが使用する Java バージョンによって異なります。

source: The deployment resource should not start until the job has been completed. The typical pattern that is used among Kubernetes users is the use of init containers to achieve this. An init container that `wait for` the job to complete is enough to enforce that requirement.
ja_jp: デプロイメントリソースは、ジョブが完了するまで開始すべきではありません。Kubernetesユーザーの間で使用されている典型的なパターンは、これを実現するためにinitコンテナを使用することです。この要件を実現するためには、ジョブの完了を `wait for` するinitコンテナだけで十分です。

source: The deployment resource should not start until the job has been completed. The typical pattern that is used among Kubernetes users is the use of init containers to achieve this. An init container that `waits for` the job to complete is enough to enforce that requirement.
ja_jp: デプロイリソースは、ジョブが完了するまで開始すべきではありません。 Kubernetesユーザーの間で使用されている典型的なパターンは、これを実現するためにinitコンテナを使用することです。ジョブを完了させるには、 `waits for` 、initコンテナだけで十分です。

source: The deserialize method uses the `KeyProxy` to recreate the `DSAPublicKey` from its encoded form using the key factory.
ja_jp: デシリアル化メソッドは `KeyProxy` を使用して、キーファクトリーでエンコードされた形式から `DSAPublicKey` を再作成します。

source: The deserializer classname used to deserialize the record's key Type: _string_
ja_jp: レコードのキーをデシリアライズするために使用されるデシリアライザのクラス名 Type: _string_

source: The deserializer classname used to deserialize the record's value Type: _string_
ja_jp: レコードの値のデシリアライズに使用されるデシリアライザのクラス名 Type: _string_

source: The dev tools, such as the Quarkus CLI, Maven or Gradle plugins, can be used to create and manage a Quarkus application project using the new platform model.
ja_jp: Quarkus CLI、MavenまたはGradleプラグインなどの開発ツールを使用して、新しいプラットフォームモデルを使用したQuarkusアプリケーションプロジェクトを作成し、管理することができます。

source: The developer experience plays an important a role in the adoption of any technology. Being able to go from ideation to delivery, quickly and confidently, helps foster innovation and contributes to delivering a world-class product.
ja_jp: デベロッパーエクスペリエンスは、あらゆるテクノロジーの採用において重要な役割を果たします。アイデア出しから納品までを迅速かつ自信を持って行えることは、イノベーションを促進し、ワールドクラスの製品を提供することにつながります。

source: The developer has the ability to disable this validation in their settings. `qute.validation.enabled` controls the global validation for the current workspace, while `qute.validation.excluded` can be populated with Qute templates that should be ignored from validation.
ja_jp: `qute.validation.enabled` は、現在のワークスペースのグローバルな検証を制御し、 `qute.validation.excluded` は、検証を無視すべき Qute テンプレートを入力することができます。

source: The development CA is a Certificate Authority that can be used to sign certificates locally. Note that the generated CA is only valid for development purposes and can only be trusted on the local machine.
ja_jp: 開発 CA は、ローカルで証明書に署名するために使用できる認証局です。 生成された CA は開発目的でのみ有効であり、ローカルマシン上でのみ信頼できることに注意してください。

source: The development CA is a Certificate Authority that can be used to sign certificates locally. Note that the generated CA is valid only for development purposes and can be trusted only on the local machine.
ja_jp: 開発用 CA は、ローカルで証明書に署名するために使用できる認証局です。生成された CA は開発目的でのみ有効であり、ローカルマシン上でのみ信頼できることに注意してください。

source: The development of Azure functions is easier than ever, thanks to the new Azure Functions extension.
ja_jp: 新しいAzure Functionsエクステンションのおかげで、Azure Functionsの開発はこれまで以上に簡単になりました。

source: The development of Quarkus 3 started last year on March 18, 2022, with the crazy idea that we could rewrite the whole tree to migrate to the new `jakarta.*` packages while continuing the development of Quarkus 2.
ja_jp: Quarkus 2の開発を続けながら、新しい `jakarta.*` パッケージに移行するためにツリー全体を書き換えるというクレイジーなアイデアで、Quarkus 3の開発は昨年の2022年3月18日に始まりました。

source: The development/test infrastructure for Infinispan got major improvements in the form of a test resource and a dev service: you can automatically start Infinispan in dev mode and in your tests.
ja_jp: Infinispanの開発/テストインフラは、テストリソースとdev serviceという形で大幅に改善されました。

source: The dialect will be selected and configured automatically based on your datasource; you may want to <<hibernate-dialect,configure it to more precisely match your database>>.
ja_jp: ダイアレクトはデータソースに基づいて自動的に選択および設定されます。 <<hibernate-dialect,configure it to more precisely match your database>> (データベースにより正確に一致するように設定) することを推奨します。

source: The dialect will be selected and configured automatically based on your datasource; you may want to xref:hibernate-dialect[configure it to more precisely match your database].
ja_jp: dialectは、データソースに基づいて自動的に選択され、設定されますが、 xref:hibernate-dialect[より正確にデータベースに適合するように設定] することもできます。

source: The dialect will be selected based on the JDBC driver - unless you set one explicitly.
ja_jp: 方言(dialect)は、明示的に設定しない限りはJDBCドライバに基づいて選択されます。

source: The dialect will be selected based on the Reactive SQL client - unless you set one explicitly.
ja_jp: dialectは、Reactive SQLクライアントに基づいて選択されます（明示的に設定しない限り）。

source: The difference between the final timestamp and the first timestamp is the total startup time for the application to serve the first request.
ja_jp: 最終タイムスタンプと最初のタイムスタンプの差は、アプリケーションが最初のリクエストにサービスを提供するまでの総起動時間です。

source: The difference is that it works with xref:rest-client.adoc[Reactive RestClient] and implements a non-blocking client filter that does not block the current IO thread when acquiring or refreshing the tokens.
ja_jp: 違いは、 xref:rest-client.adoc[Reactive RestClient] で動作し、トークンの取得または更新時に現在の IO スレッドをブロックしないノンブロッキングクライアントフィルターを実装している点です。

source: The disadvantage of `@javax.annotation.Priority` is that it has `@Target({ TYPE, PARAMETER })` and so it cannot be used for producer methods and fields. This problem should be fixed in Common Annotations 2.1. Users are encouraged to use `@io.quarkus.arc.Priority` instead, until Quarkus upgrades to this version of `jakarta.annotation-api`.
ja_jp: `@javax.annotation.Priority` の欠点は、 `@Target({ TYPE, PARAMETER })` であるため、プロデューサーメソッドおよびフィールドには使用できません。この問題は、Common Annotations 2.1 で修正する必要があります。Quarkus がこのバージョンの `jakarta.annotation-api` にアップグレードするまでは、代わりに `@io.quarkus.arc.Priority` を使用することをお勧めします。

source: The docs are not done yet (stay tuned for an upcoming blog post)
ja_jp: ドキュメントはまだ完成していません (次回のブログ記事をお楽しみに)

source: The document preview should now include a new section called `1. Create a new project`, that contains steps for creating a new project using both the Quarkus CLI and maven.
ja_jp: ドキュメントのプレビューには、 `1. Create a new project` という新しいセクションが追加されているはずです。このセクションには、Quarkus CLI と maven の両方を使用して新しいプロジェクトを作成するための手順が含まれています。

source: The documentation for the `main` branch is available link:/version/main/guides/[on the website].
ja_jp: `main` ブランチのドキュメントは link:/version/main/guides/[ウェブサイト] で公開されています。

source: The documentation is generated in the global `target/asciidoc/generated/config/` located at the root of the project.
ja_jp: ドキュメントはプロジェクトのルートにあるグローバル `target/asciidoc/generated/config/` で生成されます。

source: The documentation is generated with a title level of 2 (i.e. `==`). You usually need to adjust it. It can be done with `leveloffset=+N`.
ja_jp: ドキュメントはタイトルレベルが2(例: `==` )で生成されます。通常はこれを調整する必要があります。これは `leveloffset=+N` で行うことが可能です。

source: The documentation is generated with a title level of 2 (i.e. `==`). It may need an adjustment with `leveloffset=+N`.
ja_jp: ドキュメントは、タイトルレベル2（すなわち、 `==` ）で生成されます。 `leveloffset=+N` で調整が必要な場合があります。

source: The domain model of this sample project is made only by two classes, a loan application
ja_jp: このサンプルプロジェクトのドメインモデルは、ローン申請と

source: The double quotes are mandatory if your region name contains a dot. For instance:
ja_jp: 領域名にドットが含まれている場合は二重引用符が必須です。次のようになります:

source: The dynamic parts of a template include comments, expressions, sections and unparsed character data.
ja_jp: テンプレートの動的なパーツには、コメント、式、セクション、パースされていない文字データなどがあります。

source: The earlier mentioned `db-demo` property-configuration identifier now has a double role and also completes the following actions:
ja_jp: 先に述べた `db-demo` property-configuration 識別子は、2 つのロールを持つようになり、以下の動作も完了します。

source: The easiest option to resolve it is to disable HTTPS with a `quarkus.keycloak.devservices.disable-https=true` property. It runs the following Keycloak admin command inside your Keycloak container everytime it restarts:
ja_jp: これを解決する最も簡単な方法は、`quarkus.keycloak.devservices.disable-https=true` 設定プロパティーで HTTPS を無効にすることです。これは、再起動するたびに Keycloak コンテナー内で以下の Keycloak 管理コマンドを実行します。

source: The easiest to become productive with
ja_jp: 最も簡単に生産性を上げることができる

source: The easiest way to add permissions to a role-enabled `SecurityIdentity` instance is to map roles to permissions. Use <<authorization-using-configuration>> to grant the required `SecurityIdentity` permissions for `CRUDResource` endpoints to authenticated requests, as outlined in the following example:
ja_jp: ロール対応の `SecurityIdentity` インスタンスに権限を追加する最も簡単な方法は、ロールを権限にマップすることです。 <<authorization-using-configuration>> を使用して、次の例に示すように、認証されたリクエストに対して `CRUDResource` エンドポイントに必要な `SecurityIdentity` 権限を付与します。

source: The easiest way to create a new Quarkus project is to open a terminal and run the following command:
ja_jp: 新しい Quarkus プロジェクトを作成する最も簡単な方法は、ターミナルを開いて以下のコマンドを実行することです。

source: The easiest way to define roles that are allowed to access individual resources is the `@RolesAllowed` annotation. Nevertheless, it is also possible to use the HTTP Security Policy like in the example below:
ja_jp: 個々のリソースにアクセスできるロールを定義する最も簡単な方法は、 `@RolesAllowed` アノテーションを使用することです。 ただし、次の例のように HTTP セキュリティーポリシーを使用することもできます。

source: The easiest way to define your transaction boundaries is to use the `@Transactional` annotation on your entry method (`jakarta.transaction.Transactional`).
ja_jp: トランザクションの境界を定義する最も簡単な方法は、エントリーメソッドに `@Transactional` アノテーションを使用することです( `jakarta.transaction.Transactional` )。

source: The easiest way to define your transaction boundaries is to use the `@Transactional` annotation on your entry method (`javax.transaction.Transactional`).
ja_jp: トランザクションの境界を定義する最も簡単な方法は、エントリーメソッド ( `javax.transaction.Transactional` ) で `@Transactional` アノテーションを使用することです。

source: The easiest way to explore this new platform resolution capability is using the new https://quarkus.io/guides/cli-tooling[Quarkus CLI], which can be installed using e.g.
ja_jp: この新しいプラットフォーム解決機能を利用する最も簡単な方法は、新しい link:https://quarkus.io/guides/cli-tooling[Quarkus CLI]を使用することです。インストール方法は次の通りです。例 :

source: The easiest way to locally run your function is using the Cloud Function invoker JAR.
ja_jp: 関数をローカルで実行する最も簡単な方法は、Cloud Function invoker JAR を使用することです。

source: The easiest way to locally test your function is using the Cloud Function invoker JAR.
ja_jp: 関数をローカルでテストする最も簡単な方法は、Cloud Function invoker JAR を使用することです。

source: The easiest way to register <<template-locator,template locators>> is to make them CDI beans. As the custom locator is not available during the build time when a template validation is done, you need to disable the validation via the `@Locate` annotation.
ja_jp: <<template-locator,template locators>> を登録する最も簡単な方法は、これらを CDI Bean にすることです。 テンプレート検証を行うビルド時にはカスタムロケーターは利用できないので、`@Locate` アノテーションで検証を無効化する必要があります。

source: The easiest way to register a class for reflection is to use the `@RegisterForReflection` annotation:
ja_jp: リフレクション用のクラスを登録する最も簡単な方法は、`@RegisterForReflection` アノテーションを使用することです。

source: The easiest way to register xref:template-locator[template locators] is to make them CDI beans. As the custom locator is not available during the build time when a template validation is done, you need to disable the validation via the `@Locate` annotation.
ja_jp: xref:template-locator[テンプレートロケータ] を登録する最も簡単な方法は、CDI Beanにすることです。テンプレート検証を行うビルド時にはカスタムロケータは利用できないので、 `@Locate` アノテーションで検証を無効化する必要があります。

source: The easiest way to set up users and roles for our example is to use the `security-properties-file` extension. This extension essentially allows users and roles to be defined in the main Quarkus configuration file - `application.properties`. For more information about this extension check xref:security-properties.adoc[the associated guide]. An example configuration would be the following:
ja_jp: この例でユーザーとロールを設定する最も簡単な方法は、 `security-properties-file` エクステンションを使用することです。このエクステンションにより、基本的に、ユーザーとロールをメインの Quarkus 設定ファイル (`application.properties`) で定義できます。このエクステンションの詳細については、xref:security-properties.adoc[the associated guide] を確認してください。設定例は以下のとおりです。
